package everyDayQuestion.june._0629;

/**
 * @author hyc
 * @date 2020/6/29
 */

/**
 *  ■题目描述
 * 考试题目和要点:
 * 1、中文大写金额数字前应标明“人民币”字样。中文大写金额数字应用壹、贰、叁、
 * 肆、伍、陆、柒、捌、玖、拾、佰、任、万、亿、元、角、分、零、整等字样填写。
 * (30分)
 * 2、中文大写金额数字到“元”为止的，在“元”之后，应写“整字，如￥532 00应写成“人
 * 民币伍佰参拾贰元整”。在"角“和”分“后面不写整字。(30分)
 * 3、阿拉伯数字中间有“0”时，中文大写要写“零”字，阿拉伯数字中间连续有几个“0”时，
 * 中文大写金额中间只写一个“零”字， 如￥6007.14，应写成人民币陆仟零柒元壹角肆分
 * 输入描述:
 * 输入一个doub1e数
 * 输出描述:
 * 输出人民币格式
 * 示例1输入输出示例仅供调试， 后台判题数据一般不包含示例
 * 输入
 * | 复制
 * 151121.15
 * 输出
 * 复制
 * 人民币拾伍万 壹仟壹佰贰拾壹元壹角伍分
 */

//这个题，看着就恶心的很
public class RMB {
    public static String[] unit1 = {"","拾","佰","仟"};
    public static String[] unit2 = {"","万","亿"};
    public static String[] digital = {"零","壹","贰","叁","肆","伍","陆","柒","捌","玖"};
    int value;
    int type;
    String strNum = "";
}
